app/views/pages/home.html.erb

                            <div class="col-sm-4" style="font-size: 90%; margin-top: 8px">Posts<br>
                                <h6 style="color: rgba(59, 89, 152, 1); font-size: 150%;"><%= current_user.posts.count %></h6>
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

                <%# Displaying the post author's profile picture as a thumbnail %>
                <div class="round-image-50"><%= image_tag(User.find(@p.user_id).profilepic.url(:thumb)) %></div>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]

                <%# Displaying the post author's username and the time and date of post creation %>
                <p class="post-title"><a href="/user/<%= User.find(@p.user_id).username %>"><span class="post-user_id"><%= User.find(@p.user_id).username %></span></a> <span class="post-time"> - <%= @p.created_at.to_formatted_s(:short) %></span></p>
---
SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT 1