app/views/pages/profile.html.erb

        <div class="col-sm-12" style="margin-top: -221px;">
            <div class="profile-picture"><%= image_tag((User.find_by_username(params[:id])).profilepic.url(:medium)) %></div>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "username"]]

                <div class="col-sm-1">
                    <div class="round-image-50"><%= image_tag(User.find(@p.user_id).profilepic.url(:thumb)) %></div>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]

                <div class="col-sm-11">
                    <p class="post-title"><a href="/user/<%= User.find(@p.user_id).username %>"><span class="post-user_id"><%= User.find(@p.user_id).username %></span></a> <span class="post-time"> - <%= @p.created_at.to_formatted_s(:short) %></span></p>
---
SELECT "posts".* FROM "posts" WHERE (user_id = 2)  ORDER BY "posts"."created_at" DESC